meeting/minutes/2026/03-10.org
:PROPERTIES:
:ID:       9D0AB84C-3C16-4A6B-B63E-9C0D94C87F75
:END:
#+title: QT4 CG Meeting 155 Minutes 2026-03-10
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Meeting index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

#+TOC: headlines 6

* Summary of new and continuing actions [0/5]
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: new-actions
:END:


+ [ ] QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests
+ [ ] QT4CG-143-03: JK to look for C14N test suites.
+ [ ] QT4CG-144-01: MK to consider if any now lost value comparisons should be added as examples.
+ [ ] QT4CG-150-01: NW to ask Jirka for a room at XML Prague for Tuesday/Wednesday
+ [ ] QT4CG-150-04: NW to see about a status update on PR #2345; possibly schedule discussion
+ [ ] QT4CG-151-01: MK to fix the typo in the build-dateTime function.
+ [ ] QT4CG-152-01: MK to add a note about the new and old syntax for names in PR #2446
+ [ ] QT4CG-153-01: MK to investigate the indentation problem.
+ [ ] QT4CG-153-02: MK to turn my suggestions on #1949 into a PR.
+ [ ] QT4CG-154-01: MK to review why anyAtomicType didn’t, in fact, become a square box!
+ [ ] QT4CG-154-02: MK to add a note about “tunneling” package parameters.
+ [ ] QT4CG-155-01: MK to add an example of function coercion that uses ~?~.
+ [ ] QT4CG-155-02: MK to clarify that the seconds value can be 59.9, etc. (exlusive vs. inclusive)

* Draft Minutes
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: minutes
:END:

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call [8/10]
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

Regrets: DB

+ [ ] David J Birnbaum (DB)
+ [ ] Reece Dunn (RD)
+ [X] Christian Grün (CG)
+ [X] Joel Kalvesmaki (JK)
+ [X] Michael Kay (MK)
+ [X] Juri Leino (JLO)
+ [X] John Lumley (JWL)
+ [X] Alan Painter (AP
+ [X] Wendell Piez (WP)
+ [X] Norm Tovey-Walsh (NW) /Scribe/. /Chair/.

** Accept the agenda
:PROPERTIES:
:CUSTOM_ID: agenda
:END:

Proposal: Accept [[../../agenda/2026/03-10.html][the agenda]].

Accepted.

** Approve minutes of the previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Proposal: Accept [[../../minutes/2026/03-03.html][the minutes of the previous meeting]].

Accepted.

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

The next meeting is planned for 17 March 2026.

Note: Daylight Saving Time begins in North America on Sunday, 8 March. It does
not begin in the UK and Europe until Sunday, 29 March. The QT4CG
meets on UK and European civil time. The meetings of 17 and 24 March will
be *one hour later* in North America.

NW gives regrets for 17, 24, and 31 March. He’ll try to publish agendas per
usual and if the appointed scribe sends notes, he’ll integrate them into the
archive as usual.

JK to chair. JWL volunteers to scribe at least some of them.

** Review of open action items [3/14]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

+ [ ] QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests
+ [ ] QT4CG-143-03: JK to look for C14N test suites.
+ [ ] QT4CG-144-01: MK to consider if any now lost value comparisons should be added as examples.
+ [X] QT4CG-149-01: CG to draft a new PR with the common rule note.
+ [ ] QT4CG-150-01: NW to ask Jirka for a room at XML Prague for Tuesday/Wednesday
+ [ ] QT4CG-150-04: NW to see about a status update on PR #2345; possibly schedule discussion
+ [ ] QT4CG-151-01: MK to fix the typo in the build-dateTime function.
+ [X] QT4CG-151-03: NW to investigate why records are formatted incorrectly in XSLT
+ [ ] QT4CG-152-01: MK to add a note about the new and old syntax for names in PR #2446
+ [ ] QT4CG-153-01: MK to investigate the indentation problem.
+ [ ] QT4CG-153-02: MK to turn my suggestions on #1949 into a PR.
+ [ ] QT4CG-154-01: MK to review why anyAtomicType didn’t, in fact, become a square box!
+ [ ] QT4CG-154-02: MK to add a note about “tunneling” package parameters.
+ [X] QT4CG-154-03: NW to make sure that the streaming spec goes in the diff list

** Review of open pull requests and issues
:PROPERTIES:
:CUSTOM_ID: open-pull-requests
:END:

This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See [[#technical-agenda][Technical Agenda]] below for the focus of this
meeting.

