meeting/minutes/2026/03-10.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 155 Minutes 2026-03-10</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 155 Minutes 2026-03-10</h1>
<p>
<a href="../">Meeting index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#new-actions">Summary of new and continuing actions <code>[0/13]</code></a></li>
<li><a href="#minutes">Minutes</a></li>
<li><a href="#administrivia">1. Administrivia</a>
<ul>
<li><a href="#roll-call">1.1. Roll call <code>[8/10]</code></a></li>
<li><a href="#agenda">1.2. Accept the agenda</a></li>
<li><a href="#approve-minutes">1.3. Approve minutes of the previous meeting</a></li>
<li><a href="#next-meeting">1.4. Next meeting</a></li>
<li><a href="#open-actions">1.5. Review of open action items <code>[3/14]</code></a></li>
<li><a href="#open-pull-requests">1.6. Review of open pull requests and issues</a>
<ul>
<li><a href="#blocked">1.6.1. Blocked</a></li>
<li><a href="#merge-without-discussion">1.6.2. Merge without discussion</a></li>
<li><a href="#substantive">1.6.3. Substantive PRs</a></li>
<li><a href="#issues-discuss">1.6.4. Issues to be discussed</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#technical-agenda">2. Technical agenda</a>
<ul>
<li><a href="#iss-2462">2.1. Issue #2462: Revert dynamic function calls on sequences</a></li>
<li><a href="#pr-2510">2.2. PR #2510: Alternate proposal for #2460</a></li>
<li><a href="#pr-2506">2.3. PR #2506: 2500 Coerce the target of a dynamic function call</a></li>
<li><a href="#pr-2505">2.4. PR #2505: 2503 Clarify validity of dateTime-record</a></li>
<li><a href="#pr-2504">2.5. PR #2504: Propose a minimalist alternative for generators in order to stimulate some discussion.</a></li>
<li><a href="#pr-2501">2.6. PR #2501: 2499 default priority of predicate patterns</a></li>
<li><a href="#pr-2478">2.7. PR #2478: 2476 guaranteed streamability</a></li>
</ul>
</li>
<li><a href="#any-other-business">3. Any other business</a></li>
</ul>
</div>
</div>
<div id="outline-container-new-actions" class="outline-2">
<h2 id="new-actions">Summary of new and continuing actions <code>[0/13]</code></h2>
<div class="outline-text-2" id="text-new-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-143-03: JK to look for C14N test suites.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-144-01: MK to consider if any now lost value comparisons should be added as examples.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-150-01: NW to ask Jirka for a room at XML Prague for Tuesday/Wednesday</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-150-04: NW to see about a status update on PR #2345; possibly schedule discussion</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-151-01: MK to fix the typo in the build-dateTime function.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-152-01: MK to add a note about the new and old syntax for names in PR #2446</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-153-01: MK to investigate the indentation problem.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-153-02: MK to turn my suggestions on #1949 into a PR.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-154-01: MK to review why anyAtomicType didn’t, in fact, become a square box!</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-154-02: MK to add a note about “tunneling” package parameters.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-155-01: MK to add an example of function coercion that uses <code>?</code>.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-155-02: MK to clarify that the seconds value can be 59.9, etc. (exlusive vs. inclusive)</li>
</ul>
</div>
</div>
<div id="outline-container-minutes" class="outline-2">
<h2 id="minutes">Minutes</h2>
<div class="outline-text-2" id="text-minutes">
<p>
Approved <a href="../2026/03-17.html">at meeting 156</a> on 17 March 2026.
</p>
</div>
</div>
<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>
<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call <code>[8/10]</code></h3>
<div class="outline-text-3" id="text-roll-call">
<p>
Regrets: DB
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> David J Birnbaum (DB)</li>
<li class="off"><code>[&#xa0;]</code> Reece Dunn (RD)</li>
<li class="on"><code>[X]</code> Christian Grün (CG)</li>
<li class="on"><code>[X]</code> Joel Kalvesmaki (JK)</li>
<li class="on"><code>[X]</code> Michael Kay (MK)</li>
<li class="on"><code>[X]</code> Juri Leino (JLO)</li>
<li class="on"><code>[X]</code> John Lumley (JWL)</li>
<li class="on"><code>[X]</code> Alan Painter (AP</li>
<li class="on"><code>[X]</code> Wendell Piez (WP)</li>
<li class="on"><code>[X]</code> Norm Tovey-Walsh (NW) <i>Scribe</i>. <i>Chair</i>.</li>
</ul>
</div>
</div>
<div id="outline-container-agenda" class="outline-3">
<h3 id="agenda"><span class="section-number-3">1.2.</span> Accept the agenda</h3>
<div class="outline-text-3" id="text-agenda">
<p>
Proposal: Accept <a href="../../agenda/2026/03-10.html">the agenda</a>.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of the previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Proposal: Accept <a href="../../minutes/2026/03-03.html">the minutes of the previous meeting</a>.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
The next meeting is planned for 17 March 2026.
</p>

<p>
Note: Daylight Saving Time begins in North America on Sunday, 8 March. It does
not begin in the UK and Europe until Sunday, 29 March. The QT4CG
meets on UK and European civil time. The meetings of 17 and 24 March will
be <b>one hour later</b> in North America.
</p>

<p>
NW gives regrets for 17, 24, and 31 March. He’ll try to publish agendas per
usual and if the appointed scribe sends notes, he’ll integrate them into the
archive as usual.
</p>

<p>
JK to chair. JWL volunteers to scribe at least some of them.
</p>
</div>
</div>
<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[3/14]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-143-03: JK to look for C14N test suites.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-144-01: MK to consider if any now lost value comparisons should be added as examples.</li>
<li class="on"><code>[X]</code> QT4CG-149-01: CG to draft a new PR with the common rule note.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-150-01: NW to ask Jirka for a room at XML Prague for Tuesday/Wednesday</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-150-04: NW to see about a status update on PR #2345; possibly schedule discussion</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-151-01: MK to fix the typo in the build-dateTime function.</li>
<li class="on"><code>[X]</code> QT4CG-151-03: NW to investigate why records are formatted incorrectly in XSLT</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-152-01: MK to add a note about the new and old syntax for names in PR #2446</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-153-01: MK to investigate the indentation problem.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-153-02: MK to turn my suggestions on #1949 into a PR.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-154-01: MK to review why anyAtomicType didn’t, in fact, become a square box!</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-154-02: MK to add a note about “tunneling” package parameters.</li>
<li class="on"><code>[X]</code> QT4CG-154-03: NW to make sure that the streaming spec goes in the diff list</li>
</ul>
</div>
</div>
<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
<p>
This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See <a href="#technical-agenda">Technical Agenda</a> below for the focus of this
meeting.
</p>
</div>
