meeting/minutes/2026/03-10.org
*** Blocked
:PROPERTIES:
:CUSTOM_ID: blocked
:END:

The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.

+ PR [[https://qt4cg.org/dashboard/#pr-2266][#2266]]: 540 system-property equivalent for XQuery
+ PR [[https://qt4cg.org/dashboard/#pr-2160][#2160]]: 2073 data model changes for JNodes and Sequences
+ PR [[https://qt4cg.org/dashboard/#pr-2071][#2071]]: 77c deep update
+ PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]]: 1776: XSLT template rules for maps and array

*** Merge without discussion
:PROPERTIES:
:CUSTOM_ID: merge-without-discussion
:END:

The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.

+ PR [[https://qt4cg.org/dashboard/#pr-2509][#2509]]: 2477 Get current date in streaming spec
+ PR [[https://qt4cg.org/dashboard/#pr-2507][#2507]]: 2498 Change output of type-of() when applied to a JNode

Proposal: merge without discussion.

Accepted.

*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:END:

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-2510][#2510]]: Alternate proposal for #2460
+ PR [[https://qt4cg.org/dashboard/#pr-2509][#2509]]: 2477 Get current date in streaming spec
+ PR [[https://qt4cg.org/dashboard/#pr-2508][#2508]]: 2353 (stylesheet change)
+ PR [[https://qt4cg.org/dashboard/#pr-2506][#2506]]: 2500 Coerce the target of a dynamic function call
+ PR [[https://qt4cg.org/dashboard/#pr-2505][#2505]]: 2503 Clarify validity of dateTime-record
+ PR [[https://qt4cg.org/dashboard/#pr-2504][#2504]]: Propose a minimalist alternative for generators in order to stimulate some discussion.
+ PR [[https://qt4cg.org/dashboard/#pr-2501][#2501]]: 2499 default priority of predicate patterns
+ PR [[https://qt4cg.org/dashboard/#pr-2478][#2478]]: 2476 guaranteed streamability
+ PR [[https://qt4cg.org/dashboard/#pr-2470][#2470]]: 1310 Functions fn:regex and ?matching-substrings
+ PR [[https://qt4cg.org/dashboard/#pr-2467][#2467]]: Harmonize the fn: and file: functions that read text
+ PR [[https://qt4cg.org/dashboard/#pr-2350][#2350]]: 708 An alternative proposal for generators
+ PR [[https://qt4cg.org/dashboard/#pr-2345][#2345]]: 2299 Expand pipeline to allow arrow expression in path expression
+ PR [[https://qt4cg.org/dashboard/#pr-2313][#2313]]: 2298 XQFO rules: definition of default values
+ PR [[https://qt4cg.org/dashboard/#pr-2247][#2247]]: 716 Deferred Evaluation in XPath - the f:generator record
+ PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]]: 1776: XSLT template rules for maps and array

*** Issues to be discussed
:PROPERTIES:
:CUSTOM_ID: issues-discuss
:END:

+ Issue [[https://github.com/qt4cg/qtspecs/issues/2462][#2462]]: Revert dynamic function calls on sequences

* Technical agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** Issue #2462: Revert dynamic function calls on sequences
:PROPERTIES:
:CUSTOM_ID: iss-2462
:END:
See issue [[https://github.com/qt4cg/qtspecs/issues/2462][#2462]].

+ CG: This issue has a long history. I think I first proposed the change and so
  did MK. We generalized dynamic function calls to sequences. The challenge is
  that we got feedback from users who found this confusing. Especially from
  folks who don’t use functions. Now you can do things like ~()()~ and
  ~$add(1,2)~ returns ~()~ if ~$add~ turns out to be empty. These things can be
  quite confusing.
  + … We should favor type safety and readability over convenience. If a short
    syntax is needed, we can do better.
+ MK: I think there are two changes one could make independently: require a
  cardinality of zero or one (or maybe just one).
  + … In each case a dynamic function is a postfix operation and in other cases
    we allow arbitrary sequence son the left.
  + … On the left of open paren, you can have a path expression that can return
    an arbitrary sequence of things (like maps). You can treat those as
    functions and there’s an argument for making the function call syntax
    symmetric. Otherwise, the rhythm of the post fix expression gets broken.
+ JLO: I’m with MK, not being able to filter an empty sequence is also confusing.
  + … It makes sense: sometimes you have a function and sometimes you don’t.
  + … I’m in favor of keeping it.
+ WP: In XSLT, we bind a variable to a function we can call it. Is this just an extension into XPath?
  + … This enables us to do multiple calls on a sequence. I think we could explain it.
+ NW: MK can you expand on cardinality?
+ MK: At the moment, the required time on the left is function*, we could change it to be function?.
  + … But the arguments here are for not allowing empty; and I think the
    argument for keeping empty is stronger.
+ NW: I accept the orthogonality; I’m not looking forward to the first time I
  trip over ~$add(1,2)~ silently returning empty sequence.
+ JWL: Given that ~$add(1,2)~ example; ~$add~ could be any sequence of
  functions, so you’d get a sequence of results. Is ~(1,2)~ a single argument or
  a set of arguments?
+ MK: You’re invoking each of the functions with the argument list ~(1,2)~.
+ NW: I think there’s a plurality of support for keeping the status quo.
+ CG: I can live with that.

Some discussion of methods. That’s a separate issue.

Proposal: we’ll close 

** PR #2510: Alternate proposal for #2460
:PROPERTIES:
:CUSTOM_ID: pr-2510
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2510][#2510]].

Norm to amend the text to make a point out that decoding is also involved.

Norm to fix the char() reference

Proposal: Norm does the editorial things and merges it.

Accepted.

** PR #2506: 2500 Coerce the target of a dynamic function call
:PROPERTIES:
:CUSTOM_ID: pr-2506
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2506][#2506]].

+ MK: This was the observation that we have tests that assume coercion happens
  here and the spec doesn’t say so. So we need to fix one or the other.
+ MK: This PR applies coercion to the target of a dynamic function call.
  + … There’s a new example that illustrates that.
+ JWL: Can that be rewritten as ~Beatles/*?~?
+ MK: Yes.
+ JWL: And it’s the same?
+ MK: Yes.
+ JWL: Would you have to use JValue?
+ MK: No, because you wouldn’t get JNodes.

ACTION: MK to add an example of function coercion that uses ~?~.

Proposal: Accept this PR.

Accepted.

