meeting/minutes/2026/03-10.html
<div id="outline-container-blocked" class="outline-4">
<h4 id="blocked"><span class="section-number-4">1.6.1.</span> Blocked</h4>
<div class="outline-text-4" id="text-blocked">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2266">#2266</a>: 540 system-property equivalent for XQuery</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2160">#2160</a>: 2073 data model changes for JNodes and Sequences</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2071">#2071</a>: 77c deep update</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>: 1776: XSLT template rules for maps and array</li>
</ul>
</div>
</div>
<div id="outline-container-merge-without-discussion" class="outline-4">
<h4 id="merge-without-discussion"><span class="section-number-4">1.6.2.</span> Merge without discussion</h4>
<div class="outline-text-4" id="text-merge-without-discussion">
<p>
The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2509">#2509</a>: 2477 Get current date in streaming spec</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2507">#2507</a>: 2498 Change output of type-of() when applied to a JNode</li>
</ul>

<p>
Proposal: merge without discussion.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.3.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2510">#2510</a>: Alternate proposal for #2460</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2509">#2509</a>: 2477 Get current date in streaming spec</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2508">#2508</a>: 2353 (stylesheet change)</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2506">#2506</a>: 2500 Coerce the target of a dynamic function call</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2505">#2505</a>: 2503 Clarify validity of dateTime-record</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2504">#2504</a>: Propose a minimalist alternative for generators in order to stimulate some discussion.</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2501">#2501</a>: 2499 default priority of predicate patterns</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2478">#2478</a>: 2476 guaranteed streamability</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2470">#2470</a>: 1310 Functions fn:regex and ?matching-substrings</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2467">#2467</a>: Harmonize the fn: and file: functions that read text</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2350">#2350</a>: 708 An alternative proposal for generators</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2345">#2345</a>: 2299 Expand pipeline to allow arrow expression in path expression</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2313">#2313</a>: 2298 XQFO rules: definition of default values</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2247">#2247</a>: 716 Deferred Evaluation in XPath - the f:generator record</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>: 1776: XSLT template rules for maps and array</li>
</ul>
</div>
</div>
<div id="outline-container-issues-discuss" class="outline-4">
<h4 id="issues-discuss"><span class="section-number-4">1.6.4.</span> Issues to be discussed</h4>
<div class="outline-text-4" id="text-issues-discuss">
<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2462">#2462</a>: Revert dynamic function calls on sequences</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>
<div id="outline-container-iss-2462" class="outline-3">
<h3 id="iss-2462"><span class="section-number-3">2.1.</span> Issue #2462: Revert dynamic function calls on sequences</h3>
<div class="outline-text-3" id="text-iss-2462">
<p>
See issue <a href="https://github.com/qt4cg/qtspecs/issues/2462">#2462</a>.
</p>

<ul class="org-ul">
<li>CG: This issue has a long history. I think I first proposed the change and so
did MK. We generalized dynamic function calls to sequences. The challenge is
that we got feedback from users who found this confusing. Especially from
folks who don’t use functions. Now you can do things like <code>()()</code> and
<code>$add(1,2)</code> returns <code>()</code> if <code>$add</code> turns out to be empty. These things can be
quite confusing.
<ul class="org-ul">
<li>… We should favor type safety and readability over convenience. If a short
syntax is needed, we can do better.</li>
</ul></li>
<li>MK: I think there are two changes one could make independently: require a
cardinality of zero or one (or maybe just one).
<ul class="org-ul">
<li>… In each case a dynamic function is a postfix operation and in other cases
we allow arbitrary sequence son the left.</li>
<li>… On the left of open paren, you can have a path expression that can return
an arbitrary sequence of things (like maps). You can treat those as
functions and there’s an argument for making the function call syntax
symmetric. Otherwise, the rhythm of the post fix expression gets broken.</li>
</ul></li>
<li>JLO: I’m with MK, not being able to filter an empty sequence is also confusing.
<ul class="org-ul">
<li>… It makes sense: sometimes you have a function and sometimes you don’t.</li>
<li>… I’m in favor of keeping it.</li>
</ul></li>
<li>WP: In XSLT, we bind a variable to a function we can call it. Is this just an extension into XPath?
<ul class="org-ul">
<li>… This enables us to do multiple calls on a sequence. I think we could explain it.</li>
</ul></li>
<li>NW: MK can you expand on cardinality?</li>
<li>MK: At the moment, the required time on the left is function*, we could change it to be function?.
<ul class="org-ul">
<li>… But the arguments here are for not allowing empty; and I think the
argument for keeping empty is stronger.</li>
</ul></li>
<li>NW: I accept the orthogonality; I’m not looking forward to the first time I
trip over <code>$add(1,2)</code> silently returning empty sequence.</li>
<li>JWL: Given that <code>$add(1,2)</code> example; <code>$add</code> could be any sequence of
functions, so you’d get a sequence of results. Is <code>(1,2)</code> a single argument or
a set of arguments?</li>
<li>MK: You’re invoking each of the functions with the argument list <code>(1,2)</code>.</li>
<li>NW: I think there’s a plurality of support for keeping the status quo.</li>
<li>CG: I can live with that.</li>
</ul>

<p>
Some discussion of methods. That’s a separate issue.
</p>

<p>
Proposal: we’ll close 
</p>
</div>
</div>
<div id="outline-container-pr-2510" class="outline-3">
<h3 id="pr-2510"><span class="section-number-3">2.2.</span> PR #2510: Alternate proposal for #2460</h3>
<div class="outline-text-3" id="text-pr-2510">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2510">#2510</a>.
</p>

<p>
Norm to amend the text to make a point out that decoding is also involved.
</p>

<p>
Norm to fix the char() reference
</p>

<p>
Proposal: Norm does the editorial things and merges it.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2506" class="outline-3">
<h3 id="pr-2506"><span class="section-number-3">2.3.</span> PR #2506: 2500 Coerce the target of a dynamic function call</h3>
<div class="outline-text-3" id="text-pr-2506">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2506">#2506</a>.
</p>

<ul class="org-ul">
<li>MK: This was the observation that we have tests that assume coercion happens
here and the spec doesn’t say so. So we need to fix one or the other.</li>
<li>MK: This PR applies coercion to the target of a dynamic function call.
<ul class="org-ul">
<li>… There’s a new example that illustrates that.</li>
</ul></li>
<li>JWL: Can that be rewritten as <code>Beatles/*?</code>?</li>
<li>MK: Yes.</li>
<li>JWL: And it’s the same?</li>
<li>MK: Yes.</li>
<li>JWL: Would you have to use JValue?</li>
<li>MK: No, because you wouldn’t get JNodes.</li>
</ul>

<p>
ACTION: MK to add an example of function coercion that uses <code>?</code>.
</p>

<p>
Proposal: Accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
