meeting/minutes/2026/03-10.org
** PR #2505: 2503 Clarify validity of dateTime-record
:PROPERTIES:
:CUSTOM_ID: pr-2505
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2505][#2505]].

+ MK: The observation was that we’ve given constraints on the ranges of these values in the record.
  + … But we have no way of constraining the range. I’ve rephrased things and
    clarified it with a note.
  + … But note that it will be rejected by ~fn:build-dateTime~.
+ JWL: When reading this, I was puzzled by the difference between inclusive and exclusive.
  + … But in the case of seconds, you can go up to anything less than 60!

ACTION: MK to clarify that the seconds value can be 59.9, etc. (exlusive vs. inclusive)

+ JLO: Is ~dateTime-record~ something we could use for other calendars?
+ MK: No, it’s intended to correspond to the Gregorian calendar.

(JK observes: https://www.wwp.neu.edu/research/publications/documentation/other/dates_and_times_in_DH.xhtml )

Proposal: Accept this PR.

Accepted.

** PR #2504: Propose a minimalist alternative for generators in order to stimulate some discussion.
:PROPERTIES:
:CUSTOM_ID: pr-2504
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2504][#2504]].

+ AP: I was trying to take a different approach than DN. But I stole a lot of things from him.
  + … I added another section about data formats.
  + … I called it a ~generate-record~ because I think it’s more precise.
  + … I remove a couple of fields.
  + … I’m suggesting rather than having a field end-reached, we compare the
    generator with an empty generator.
  + … The empty generator is returned by ~fn:empty-generator~.
  + … ~gn:empty~ then returns true if the generator is empty.
  + … I was hoping for reference equality; but that’s not going to work.
  + … But we should be able to count on ~fn:deep-equals~.
+ AP: And there are a couple of examples. An unbounded one and a couple of examples of bounded ones.

+ JWL: There’s a typo on the signature for ~empty~; it shouldn’t be ~empty-generator~ in 17.7.3.2.
  + … This looks like a nice minimalist approach. But don’t you have to make
    repeated calls to the comparison function. I’m not absolutely sure that’s the neatest way to do it.
+ NW: If you return empty generator after you’ve finished, how do you get the
  final accumulated results?
+ AP: I think you’re misunderstanding.
+ NW: Perhaps. I’ll investigate.
+ MK: I greatly appreciate the fact that this is much more minimilist.
  + … I don’t think I’ve understood the detail well enough to understand the usibility.
  + … It would be nice to see a more realistic use case that illustrates that.
  + … And it would be nice to have an example that you can’t do some other way:
    what does this enable? It needs a better “sell”.
+ AP: I have another one I’m working on that’s the equivalent of slice; that’s
  currently an iteration over all the items in a sequence; the generator
  wouldn’t have to work that way.
+ MK: I do think it would be better in its own section, not in data formats.
+ AP: Okay.
+ MK: An example that uses the functions in the file module might help to motivate it.
+ CG: Thank you. I like the minimilist approach. It’s much easier to digest.
  Many of the examples we saw for generators can be realized with recursive
  functions, with while loops, with fold-left; it might be nice to show
  comparisons to those features. Some use cases are easier to express without
  generators, but some are really suited to them. It would be nice to see the
  really suitable example.
+ AP: Okay.
+ JLO: I also think this is easier to take in. But I fear, looking at the ~fib0~
  example, you don’t want to do that, do you?
  + … It looks like it could be a while loop!
+ AP: My experience doing this for the JSONPath example was that this was the
  only way to calculate them incrementally.
  + … This is a lot of code; I’ll try to make it shorter.

Some discussion of how this might be a fold.

** PR #2501: 2499 default priority of predicate patterns
:PROPERTIES:
:CUSTOM_ID: pr-2501
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2501][#2501]].

+ MK: This is a bug fix to change it from 0.5 to 1. That’s for compatibility with XSLT 3.0.
  + … 0.5 would be more logical, but it’s not worth it.

Proposal: Accept this PR.

Accepted.

** PR #2478: 2476 guaranteed streamability
:PROPERTIES:
:CUSTOM_ID: pr-2478
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2478][#2478]].

+ MK: This is part of the exercise to update streaming to 4.0.
+ MK: The spec has rules for construct that are supposed to be guaranteed streamable.
  + … I wanted to make that a minimal constraint; the current spec has to check
    for things that you might optimize away.
  + … It’s very hard to implement. The only benefit is that if it’s streamable
    on one processor, it’ll be streamable on all of them.

Proposal: Accept this PR.

Accepted.

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:

None heard.
