meeting/minutes/2026/03-10.html
<div id="outline-container-pr-2505" class="outline-3">
<h3 id="pr-2505"><span class="section-number-3">2.4.</span> PR #2505: 2503 Clarify validity of dateTime-record</h3>
<div class="outline-text-3" id="text-pr-2505">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2505">#2505</a>.
</p>

<ul class="org-ul">
<li>MK: The observation was that we’ve given constraints on the ranges of these values in the record.
<ul class="org-ul">
<li>… But we have no way of constraining the range. I’ve rephrased things and
clarified it with a note.</li>
<li>… But note that it will be rejected by <code>fn:build-dateTime</code>.</li>
</ul></li>
<li>JWL: When reading this, I was puzzled by the difference between inclusive and exclusive.
<ul class="org-ul">
<li>… But in the case of seconds, you can go up to anything less than 60!</li>
</ul></li>
</ul>

<p>
ACTION: MK to clarify that the seconds value can be 59.9, etc. (exlusive vs. inclusive)
</p>

<ul class="org-ul">
<li>JLO: Is <code>dateTime-record</code> something we could use for other calendars?</li>
<li>MK: No, it’s intended to correspond to the Gregorian calendar.</li>
</ul>

<p>
(JK observes: <a href="https://www.wwp.neu.edu/research/publications/documentation/other/dates_and_times_in_DH.xhtml">https://www.wwp.neu.edu/research/publications/documentation/other/dates_and_times_in_DH.xhtml</a> )
</p>

<p>
Proposal: Accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2504" class="outline-3">
<h3 id="pr-2504"><span class="section-number-3">2.5.</span> PR #2504: Propose a minimalist alternative for generators in order to stimulate some discussion.</h3>
<div class="outline-text-3" id="text-pr-2504">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2504">#2504</a>.
</p>

<ul class="org-ul">
<li>AP: I was trying to take a different approach than DN. But I stole a lot of things from him.
<ul class="org-ul">
<li>… I added another section about data formats.</li>
<li>… I called it a <code>generate-record</code> because I think it’s more precise.</li>
<li>… I remove a couple of fields.</li>
<li>… I’m suggesting rather than having a field end-reached, we compare the
generator with an empty generator.</li>
<li>… The empty generator is returned by <code>fn:empty-generator</code>.</li>
<li>… <code>gn:empty</code> then returns true if the generator is empty.</li>
<li>… I was hoping for reference equality; but that’s not going to work.</li>
<li>… But we should be able to count on <code>fn:deep-equals</code>.</li>
</ul></li>
<li>AP: And there are a couple of examples. An unbounded one and a couple of examples of bounded ones.</li>

<li>JWL: There’s a typo on the signature for <code>empty</code>; it shouldn’t be <code>empty-generator</code> in 17.7.3.2.
<ul class="org-ul">
<li>… This looks like a nice minimalist approach. But don’t you have to make
repeated calls to the comparison function. I’m not absolutely sure that’s the neatest way to do it.</li>
</ul></li>
<li>NW: If you return empty generator after you’ve finished, how do you get the
final accumulated results?</li>
<li>AP: I think you’re misunderstanding.</li>
<li>NW: Perhaps. I’ll investigate.</li>
<li>MK: I greatly appreciate the fact that this is much more minimilist.
<ul class="org-ul">
<li>… I don’t think I’ve understood the detail well enough to understand the usibility.</li>
<li>… It would be nice to see a more realistic use case that illustrates that.</li>
<li>… And it would be nice to have an example that you can’t do some other way:
what does this enable? It needs a better “sell”.</li>
</ul></li>
<li>AP: I have another one I’m working on that’s the equivalent of slice; that’s
currently an iteration over all the items in a sequence; the generator
wouldn’t have to work that way.</li>
<li>MK: I do think it would be better in its own section, not in data formats.</li>
<li>AP: Okay.</li>
<li>MK: An example that uses the functions in the file module might help to motivate it.</li>
<li>CG: Thank you. I like the minimilist approach. It’s much easier to digest.
Many of the examples we saw for generators can be realized with recursive
functions, with while loops, with fold-left; it might be nice to show
comparisons to those features. Some use cases are easier to express without
generators, but some are really suited to them. It would be nice to see the
really suitable example.</li>
<li>AP: Okay.</li>
<li>JLO: I also think this is easier to take in. But I fear, looking at the <code>fib0</code>
example, you don’t want to do that, do you?
<ul class="org-ul">
<li>… It looks like it could be a while loop!</li>
</ul></li>
<li>AP: My experience doing this for the JSONPath example was that this was the
only way to calculate them incrementally.
<ul class="org-ul">
<li>… This is a lot of code; I’ll try to make it shorter.</li>
</ul></li>
</ul>

<p>
Some discussion of how this might be a fold.
</p>
</div>
</div>
<div id="outline-container-pr-2501" class="outline-3">
<h3 id="pr-2501"><span class="section-number-3">2.6.</span> PR #2501: 2499 default priority of predicate patterns</h3>
<div class="outline-text-3" id="text-pr-2501">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2501">#2501</a>.
</p>

<ul class="org-ul">
<li>MK: This is a bug fix to change it from 0.5 to 1. That’s for compatibility with XSLT 3.0.
<ul class="org-ul">
<li>… 0.5 would be more logical, but it’s not worth it.</li>
</ul></li>
</ul>

<p>
Proposal: Accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2478" class="outline-3">
<h3 id="pr-2478"><span class="section-number-3">2.7.</span> PR #2478: 2476 guaranteed streamability</h3>
<div class="outline-text-3" id="text-pr-2478">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2478">#2478</a>.
</p>

<ul class="org-ul">
<li>MK: This is part of the exercise to update streaming to 4.0.</li>
<li>MK: The spec has rules for construct that are supposed to be guaranteed streamable.
<ul class="org-ul">
<li>… I wanted to make that a minimal constraint; the current spec has to check
for things that you might optimize away.</li>
<li>… It’s very hard to implement. The only benefit is that if it’s streamable
on one processor, it’ll be streamable on all of them.</li>
</ul></li>
</ul>

<p>
Proposal: Accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
</div>
<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
<p>
None heard.
</p>
</div>
</div>
</div>
</body>
</html>
